vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA175_DFP.pdsc
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Internal_GenerateMultiplicativeBlinding_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Internal_Interleave_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Internal_PointComparison_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Internal_Random_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Internal_SetupEnvironment_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_KeyEncodingMechanisms.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_KeyTypes.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Mont_Internal_MontDhX_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Mont_Internal_SecureScalarMult_XZMontLadder_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_TwEd_Internal_Convert_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_TwEd_Internal_PointArithmetic_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_TwEd_Internal_PointArithmeticEd25519_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_TwEd_Internal_PointSubtraction_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_TwEd_Internal_PointValidation_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_TwEd_Internal_UpdateExtHomCoords_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_TwEd_Internal_VarScalarMult_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Weier_Internal_BooleanToArithmeticMasking_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Weier_Internal_ConvertPoint_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Weier_Internal_DiscriminantCalculate_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Weier_Internal_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Weier_Internal_KeyGen_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Weier_Internal_PointArithmetic_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Weier_Internal_PointCheck_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Weier_Internal_SecurePointMult_CoZMontLadder_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Weier_KeyGen_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_Weier_PointMult_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_WeierECC_Internal_DecodePoint_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/mcuxClEcc_WeierECC_Internal_GenerateDomainParams_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_ECDH_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_ECDSA_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_EdDSA_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_EdDSA_Internal_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_EdDSA_Internal_Hash.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_FeatureConfig.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_Internal_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_Internal_KeyHelper.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_Internal_PkcWaLayout.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_Internal_Random.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_Internal_UPTRT_access.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_Mont_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_Mont_Internal_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_Mont_Internal_PkcWaLayout.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_TwEd_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_TwEd_Internal_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_TwEd_Internal_PkcWaLayout.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_Weier_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_Weier_Internal_FP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_Weier_Internal_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_Weier_Internal_PkcWaLayout.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_WeierECC_Internal_GenerateKeyPair.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/internal/mcuxClEcc_WeierECC_Internal_KeyValidation.h" projectpath="component/sgi_pkc/src/comps/mcuxClEcc/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClEcc/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_ecc_example" Cversion="1.0.0" condition="component.sgi_pkc.example.condition_id">
      <description>Component sgi_pkc.example</description>
      <files>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClExample/inc/mcuxClExample_OS.h" projectpath="component/sgi_pkc/src/comps/mcuxClExample/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClExample/inc/mcuxClExample_RNG_Helper.h" projectpath="component/sgi_pkc/src/comps/mcuxClExample/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClExample/inc/mcuxClExample_Session_Helper.h" projectpath="component/sgi_pkc/src/comps/mcuxClExample/inc"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClExample/inc/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_examples" Cversion="1.0.0" condition="component.sgi_pkc.examples.condition_id">
      <description>Component sgi_pkc_test</description>
      <files>
        <file category="doc" name="components/sgi_pkc/component.sgi_pkc.examples_dummy.txt"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_aead" Cversion="1.0.0" condition="component.sgi_pkc.examples_aead.condition_id">
      <description>Component sgi_pkc_test</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClAeadModes/mcuxClAeadModes_Ccm_Aes128_Multipart_example.c" projectpath="component/sgi_pkc/examples/mcuxClAeadModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClAeadModes/mcuxClAeadModes_Ccm_Aes128_Oneshot_Nist1_example.c" projectpath="component/sgi_pkc/examples/mcuxClAeadModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClAeadModes/mcuxClAeadModes_Ccm_Aes128_Oneshot_Nist2_example.c" projectpath="component/sgi_pkc/examples/mcuxClAeadModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClAeadModes/mcuxClAeadModes_Ccm_Aes128_Oneshot_PreloadedKey_example.c" projectpath="component/sgi_pkc/examples/mcuxClAeadModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClAeadModes/mcuxClAeadModes_Gcm_Aes128_Multipart_example.c" projectpath="component/sgi_pkc/examples/mcuxClAeadModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClAeadModes/mcuxClAeadModes_Gcm_Aes128_Oneshot_example.c" projectpath="component/sgi_pkc/examples/mcuxClAeadModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClAeadModes/mcuxClAeadModes_Gcm_Aes128_Oneshot_LongNonce_example.c" projectpath="component/sgi_pkc/examples/mcuxClAeadModes"/>
        <file category="include" name="components/sgi_pkc/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_cipher" Cversion="1.0.0" condition="component.sgi_pkc.examples_cipher_modes.condition_id">
      <description>Component sgi_pkc_test</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Cbc_Aes128_Multipart_example.c" projectpath="component/sgi_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Cbc_Aes128_Multipart_KeyRfc3394Encoding_example.c" projectpath="component/sgi_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Cbc_Aes128_Multipart_PaddingISO_example.c" projectpath="component/sgi_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Cbc_Aes128_Multipart_PaddingZero_example.c" projectpath="component/sgi_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Cbc_Aes128_Oneshot_example.c" projectpath="component/sgi_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Cbc_Aes128_Oneshot_PaddingISO_example.c" projectpath="component/sgi_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Cbc_Aes128_Oneshot_PaddingZero_example.c" projectpath="component/sgi_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Ctr_Aes128_Multipart_example.c" projectpath="component/sgi_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Ctr_Aes128_Oneshot_example.c" projectpath="component/sgi_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Ecb_Aes128_Multipart_example.c" projectpath="component/sgi_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Ecb_Aes128_Multipart_PaddingISO_example.c" projectpath="component/sgi_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Ecb_Aes128_Multipart_PaddingZero_example.c" projectpath="component/sgi_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Ecb_Aes128_Oneshot_example.c" projectpath="component/sgi_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Ecb_Aes128_Oneshot_PaddingISO_example.c" projectpath="component/sgi_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Ecb_Aes128_Oneshot_PaddingPKCS7_example.c" projectpath="component/sgi_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Ecb_Aes128_Oneshot_PaddingZero_example.c" projectpath="component/sgi_pkc/examples/mcuxClCipherModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClCipherModes/mcuxClCipherModes_Ecb_Aes128_Oneshot_PreloadedKey_example.c" projectpath="component/sgi_pkc/examples/mcuxClCipherModes"/>
        <file category="include" name="components/sgi_pkc/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_crc" Cversion="1.0.0" condition="component.sgi_pkc.examples_crc.condition_id">
      <description>Component sgi_pkc_test</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClCrc/mcuxClCrc_Crc16_example.c" projectpath="component/sgi_pkc/examples/mcuxClCrc"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClCrc/mcuxClCrc_Crc32_example.c" projectpath="component/sgi_pkc/examples/mcuxClCrc"/>
        <file category="include" name="components/sgi_pkc/"/>
      </files>
    </component>
